; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v10 ?v11)
             (pred_3 ?v4 ?v5)
             (pred_2 ?v10 ?v5)
             (pred_10 ?v8 ?v10 )
	     (pred_1 ?v10)
             (pred_4 ?v7)
             (pred_12 ?v4)
             (pred_5 ?v5)
             (pred_7 ?v10)
             (pred_9 ?v4)
             (pred_8 ?v10)
             (pred_11 ))



(:action op_1
:parameters (?v12 ?v3 ?v2 ?v6)
:precondition (and (pred_4 ?v12) (pred_4 ?v3) (pred_12 ?v2) (pred_5 ?v6)
          (pred_6 ?v12 ?v3) (pred_3 ?v2 ?v6)
                   (pred_2 ?v3 ?v6) (pred_1 ?v12) 
                   (pred_7 ?v3) (pred_9 ?v2))
:effect (and  (pred_8 ?v3) (not (pred_7 ?v3))))


(:action op_5
:parameters (?v12 ?v1)
:precondition (and (pred_4 ?v12) (pred_4 ?v1)
               (pred_1 ?v12) (pred_6 ?v12 ?v1) (pred_8 ?v1))
:effect (and (pred_1 ?v1) (not (pred_1 ?v12))))

(:action op_3
:parameters (?v12 ?v2)
:precondition (and (pred_4 ?v12) (pred_12 ?v2) 
                  (pred_1 ?v12) (pred_10 ?v2 ?v12) (pred_11 ))
:effect (and (pred_9 ?v2)
   (not (pred_10 ?v2 ?v12)) (not (pred_11 ))))


(:action op_2
:parameters (?v12 ?v13 ?v9)
:precondition (and (pred_4 ?v12) (pred_12 ?v13) (pred_12 ?v9)
                  (pred_1 ?v12) (pred_9 ?v9) (pred_10 ?v13 ?v12))
:effect (and (pred_9 ?v13) (pred_10 ?v9 ?v12)
        (not (pred_9 ?v9)) (not (pred_10 ?v13 ?v12))))

(:action op_4
:parameters (?v12 ?v2)
:precondition (and (pred_4 ?v12) (pred_12 ?v2) 
                  (pred_1 ?v12) (pred_9 ?v2))
:effect (and (pred_11 ) (pred_10 ?v2 ?v12) (not (pred_9 ?v2)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_13 obj_09 obj_19 obj_14 obj_07 obj_03 obj_06 obj_18 obj_21 obj_12 obj_22 obj_16 obj_08 obj_05 obj_17 obj_01
    obj_20 obj_04 obj_15
    obj_10 obj_02 obj_11
    )

    (:init
       (pred_11)

       (pred_4 obj_13)
       (pred_4 obj_09)
       (pred_4 obj_19)
       (pred_4 obj_14)
       (pred_4 obj_07)
       (pred_4 obj_03)
       (pred_4 obj_06)
       (pred_4 obj_18)
       (pred_4 obj_21)
       (pred_4 obj_12)
       (pred_4 obj_22)
       (pred_4 obj_16)
       (pred_4 obj_08)
       (pred_4 obj_05)
       (pred_4 obj_17)
       (pred_4 obj_01)
       (pred_5 obj_20)
       (pred_5 obj_04)
       (pred_5 obj_15)
       (pred_12 obj_10)
       (pred_12 obj_02)
       (pred_12 obj_11)

       (pred_6 obj_13 obj_07)
       (pred_6 obj_13 obj_09)
       (pred_6 obj_09 obj_03)
       (pred_6 obj_09 obj_19)
       (pred_6 obj_09 obj_13)
       (pred_6 obj_19 obj_06)
       (pred_6 obj_19 obj_14)
       (pred_6 obj_19 obj_09)
       (pred_6 obj_14 obj_18)
       (pred_6 obj_14 obj_19)
       (pred_6 obj_07 obj_21)
       (pred_6 obj_07 obj_03)
       (pred_6 obj_07 obj_13)
       (pred_6 obj_03 obj_12)
       (pred_6 obj_03 obj_06)
       (pred_6 obj_03 obj_09)
       (pred_6 obj_03 obj_07)
       (pred_6 obj_06 obj_22)
       (pred_6 obj_06 obj_18)
       (pred_6 obj_06 obj_19)
       (pred_6 obj_06 obj_03)
       (pred_6 obj_18 obj_16)
       (pred_6 obj_18 obj_14)
       (pred_6 obj_18 obj_06)
       (pred_6 obj_21 obj_08)
       (pred_6 obj_21 obj_12)
       (pred_6 obj_21 obj_07)
       (pred_6 obj_12 obj_05)
       (pred_6 obj_12 obj_22)
       (pred_6 obj_12 obj_03)
       (pred_6 obj_12 obj_21)
       (pred_6 obj_22 obj_17)
       (pred_6 obj_22 obj_16)
       (pred_6 obj_22 obj_06)
       (pred_6 obj_22 obj_12)
       (pred_6 obj_16 obj_01)
       (pred_6 obj_16 obj_18)
       (pred_6 obj_16 obj_22)
       (pred_6 obj_08 obj_05)
       (pred_6 obj_08 obj_21)
       (pred_6 obj_05 obj_17)
       (pred_6 obj_05 obj_12)
       (pred_6 obj_05 obj_08)
       (pred_6 obj_17 obj_01)
       (pred_6 obj_17 obj_22)
       (pred_6 obj_17 obj_05)
       (pred_6 obj_01 obj_16)
       (pred_6 obj_01 obj_17)
       (pred_7 obj_13)
       (pred_7 obj_03)
       (pred_7 obj_18)
       (pred_2  obj_13 obj_20)
       (pred_2  obj_03 obj_04)
       (pred_2  obj_18 obj_15)
       (pred_8 obj_09)
       (pred_8 obj_19)
       (pred_8 obj_14)
       (pred_8 obj_07)
       (pred_8 obj_06)
       (pred_8 obj_21)
       (pred_8 obj_12)
       (pred_8 obj_22)
       (pred_8 obj_16)
       (pred_8 obj_08)
       (pred_8 obj_05)
       (pred_8 obj_17)
       (pred_8 obj_01)

       (pred_3  obj_10 obj_20)
       (pred_3  obj_02 obj_04)
       (pred_3  obj_11 obj_15)
       (pred_10 obj_10 obj_19)
       (pred_10 obj_02 obj_08)
       (pred_10 obj_11 obj_07)
       (pred_1 obj_07)
    )

    (:goal (and
       (pred_10 obj_10 obj_09)
    ))
(:constraints
  (always (not (pred_1 obj_12)))
)
)

; plan
1. (op_5 obj_07 obj_21)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_21)
   goals met: 0 of 1
2. (op_5 obj_21 obj_08)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_08)
   goals met: 0 of 1
3. (op_5 obj_08 obj_05)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_05)
   goals met: 0 of 1
4. (op_5 obj_05 obj_17)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_17)
   goals met: 0 of 1
5. (op_5 obj_17 obj_22)
   deleted: (pred_1 obj_17)
   added: (pred_1 obj_22)
   goals met: 0 of 1
6. (op_5 obj_22 obj_06)
   deleted: (pred_1 obj_22)
   added: (pred_1 obj_06)
   goals met: 0 of 1
7. (op_5 obj_06 obj_19)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_19)
   goals met: 0 of 1
8. (op_3 obj_19 obj_10)
   deleted: (pred_10 obj_10 obj_19) (pred_11)
   added: (pred_9 obj_10)
   goals met: 0 of 1
9. (op_5 obj_19 obj_09)
   deleted: (pred_1 obj_19)
   added: (pred_1 obj_09)
   goals met: 0 of 1
10. (op_4 obj_09 obj_10)
   deleted: (pred_9 obj_10)
   added: (pred_11) (pred_10 obj_10 obj_09)
   goals met: 1 of 1
